
USE app_mstx;
CREATE TABLE kf_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64),
    price FLOAT(6,2),
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    detail VARCHAR(2048),
    material VARCHAR(2048)
);
INSERT INTO kf_dish(did,img_sm,img_lg,name,price,material,detail) VALUES
(   null,
    'p1.jpg',
    'p1-l.jpg',
    '【新鲜橙汁】',
    16,
    '白糖、新鲜橙子',
    '每天清晨给自己一杯鲜榨果汁，新的一天新的活力………… '
),
(   null,
    'p2.jpg',
    'p2-l.jpg',
    '【高级牛排】',
    66,
    '切片吐司、新鲜牛排、糖桂花、炼乳',
    '火山岩烤盘有远红外磁波，节能，无烟，无污染，环保节能的烤盘原料。味道鲜美，不会烤焦，且在烤的过程中会释放出钠、钾、钙、镁、锌微量元素，是理想的天然绿色烧烤器皿。'
),
(   null,
    'p3.jpg',
    'p3-l.jpg',
    '【拔丝红薯】',
    32,
    '红薯、麻椒、八角、香叶、葱、姜、生抽',
    '地瓜，味甘性温，能滑肠通便，健胃益气。含有较多的纤维素， 能在肠中吸收水份增大粪便的体积，引起通便的作用。糙米 糙米含有丰富的蛋白质、淀粉、维生素B1、A、E、纤维素、钙、铁和磷等矿物质，其中丰富的纤维质有助排便。'
),
(   null,
    'p4.jpg',
    'p4-l.jpg',
    '【红烧猪蹄】',
    6.5,
    '面粉、黄瓜、猪蹄、热水、土豆、盐、醋、生抽、油。',
    '红烧，家常菜做法，以这种手法做出来的菜呈深红、浅红或者枣红色，味道鲜咸微甜，酥烂适口，汁黄浓香。MAMA出门前一句：宝贝儿，今天我熬汤了。猪蹄已经捞上来了。你爱咋做就咋做吧@#&*###@。。。某人就一溜烟没影了。。。不知道是从什么时候开始，我家的荤类红烧菜就是这样做起来的：熬一锅肉骨汤，一两个小时后，大块的肉就捞上来，炖煮任由处置！特指猪蹄！可能是某个晴天的午后，PAPA的一句：难道你不觉得熬汤熬太久的猪蹄太软腻就不好吃了吗？然后，@#&*###@。。。我家的荤类红烧菜就是这样做起来的。。。来道红烧猪蹄，果断不解释。这次我做的红烧猪蹄，只放了酱料，没有香料哇。。'
),
(   null,
    'p5.jpg',
    'p5-l.jpg',
    '【特级猪排】',
    32,
    '猪排、鸡蛋、玉米淀粉、绵白糖、白醋、低筋粉、橄榄油、酸奶。',
    '酸奶蛋糕，这是第二次做。自前一次做了带去单位分享后，吃到的同事都说好吃，连不爱甜食的自己也觉得细腻可口。特别是入冰箱后取出品味风味尤佳。喜欢那一丝丝的凉意一丝丝的甜味，入口的感觉特别绵软，很适合夏季食用的。这次还是没有用黄油，因为等融化嫌麻烦，继续用了橄榄油。不同的是这次用了水浴法烘焙的。我用的模具是八寸的活底蛋糕模具，成品有一点收腰，但口味还挺成功的。只是早上拍照心急得很，因为LG上班比较早。难得他如此喜欢吃了最大的两块。'
),
(   null,
    'p6.jpg',
    'p6-l.jpg',
    '【椒盐炸鸡】',
    25,
    '新鲜鸡块、番茄、洋葱、蒜泥、肉糜、黑胡椒粉、番茄酱、盐',
    '将鸡腿肉用刀背拍松，划十字花刀后改切成4厘米见方的块，纳盆；用盐、料酒、胡椒粉、姜片、葱段等码味约5分钟； 生菜切丝，拌成糖醋味待用；锅中下油，上火烧至五成热时，将码好味的鸡腿肉挂匀蛋糊，逐一下入油锅中，炸至断生捞起；待油温升至七成热时，至色呈金黄且酥脆时，再将鸡块入锅中炝炸，捞出盛于盘中镶上生菜，随椒盐味碟及糖醋生菜上桌即可。'
),
(   null,
    'p7.jpg',
    'p7-l.jpg',
    '【甜辣鸡翅】',
    20,
    '新鲜鸡翅、面粉、安琪油条膨松剂、温水、植物油。',
    '胡萝卜切丝，菌类撕开。西兰花焯至6份熟，在鸡翅中间划上一刀，平底锅中倒入麻油，用中火烧热后加胡萝卜炒2分钟后，把鸡翅放进去煎至两面呈微焦，把菌类和调料A加进去，盖上锅盖用小火焖5分钟，倒焯过的西兰花，把火切得稍微大点收汁即可'
),
(   null,
    'p8.jpg',
    'p8-l.jpg',
    '【脆皮排骨】',
    12,
    '新鲜排骨、鸡蛋、豆角酱肉馅、西红柿鸡蛋馅、猪生抽、生抽、海鲜酱油、糖、盐',
    '蛋液中加少许面粉，蛋糊厚而粘，更容易挂糊，面包糠不易掉，做好后的脆皮稍厚，口感很脆味道也更香。排骨在裹面包糠的过程要一个一个的来，切忌多个一起，这样做完剩下的面包糠里没有滴落的蛋糊，还可以收起来下次再用。炸制的过程中，不要随便的翻动，只要一直用小火芯炸，底部是不会焦糊的，观察面包糠一直保持白颜色即可。用小火芯炸即使有面包糠散掉落在油里，也不会有焦糊味，剩下的油还能再利用。细节决定成败，只要用心去做，操作过程中，该用筷子、用手的步骤不要乱来，才能保证手、面包糠的干静，排骨的完美。熟练后做各种脆皮就是轻而易举的事。'
),
(   null,
    'p9.jpg',
    'p9-l.jpg',
    '【凉拌鸭掌】',
    36,
    '鸭掌、番茄酱、白糖、白醋、葱、姜、淀粉',
    '话说有两个地方是我挪不动脚的，一个是图书馆，另外一个便是菜市场！ 每周有七天，留给自己的时间却很少。既要带儿子去上早教课，又要陪女儿上兴趣班，还要留一个半天带孩子们泡图书馆！ 有时真的觉得妈妈是这个世界上最伟大的职业，累，并快乐着！ 这个时节正是各类果蔬大量上市的时候，拖着买菜专用的小拉车，徜徉在人声鼎沸的菜市场，从海鲜区、肉类区再慢慢逛到我最喜爱的果蔬区，感受季节的变换带给人们餐桌上的喜悦………… '
),
(   null,
    'p10.jpg',
    'p10-l.jpg',
    '【西安烤羊排】',
    88,
    '切片吐司、羊排、铁棍山药、糖桂花、炼乳',
    '羊肉的营养成分非常丰富，其组成极接近于人体，并易被消化吸收利用。检测分析羊肉中氨基酸含量丰富、种类齐全，系人体所必需的完全蛋白质来源之一。羊肉中还含有多种矿物质元素和维生素，它的营养保健功能受到众多消费者的青睐。《本草纲目》曾将羊肉与人参相提并论，美其名曰为“小人参”。'
),
(   null,
    'p3.jpg',
    'p3-l.jpg',
    '【小米椒爆炒小公鸡】',
    32,
    '三黄鸡、杭椒、干红椒、新鲜小米椒、麻椒、八角、香叶、葱、姜、生抽',
    '算起来有一个星期没有更新了，忙着赶紧完成手头的工作，和孩子一起开启度假模式。我总是毫不避讳地称自己为吃货，对于我来说，度假中缺少美食是万万不可的。想要找一个风景与美食兼顾的度假地点可不太容易，工作之余忙着查路线，查攻略，总算是定好了目的地。其实我这个嗜辣族最想去的还是成都重庆一带，考虑到季节的原因，还是留到冬天再前往吧。今天上一道火辣辣的小米椒爆炒小公鸡，虽在家中，也是十足的过了把食辣的瘾，不擅吃辣的伙伴们做这道菜的时候可要记得减少辣椒的用量哦。'
),
(   null,
    'p11.jpg',
    'p11-l.jpg',
    '【北京烤鸭】',
    65,
    '面粉、黄瓜、香肠、热水、土豆、盐、醋、生抽、油。',
    '烤鸭是具有世界声誉的北京著名菜式，起源于中国南北朝时期，《食珍录》中已记有炙鸭，在当时是宫廷食品。用料为优质肉食鸭北京鸭，果木炭火烤制，色泽红润，肉质肥而不腻，外脆里嫩。北京烤鸭分为两大流派，而北京最著名的烤鸭店也即是两派的代表。它以色泽红艳，肉质细嫩，味道醇厚，肥而不腻的特色，被誉为“天下美味”。'
),
(   null,
    'p12.jpg',
    'p12-l.jpg',
    '【番茄肉酱意大利面】',
    25,
    '意大利面、番茄、洋葱、蒜泥、肉糜、黑胡椒粉、番茄酱、盐',
    '听说，台风天，电影和意大利面更配喔汤锅倒水烧开，放一勺盐一勺橄榄油，加入意面，煮13分钟。（意面种类不同，煮的时间也不一样，5-15分钟不等）。煮好的面控水，拌入一勺橄榄油，以防面粘连。平底锅倒油预热，蒜泥炒香，下肉糜翻炒至变色，倒入洋葱丁、番茄丁，翻炒一分钟，放番茄酱、盐、黑胡椒，继续翻炒。肉酱里加热水大火烧开，倒入意面转中火，待意面吸饱汤汁后，关火盛盘。'
),
(   null,
    'p13.jpg',
    'p13-l.jpg',
    '【抹茶甜心蛋糕】',
    23,
    '面粉、安琪油条膨松剂、温水、植物油。',
    '酸奶蛋糕，这是第二次做。自前一次做了带去单位分享后，吃到的同事都说好吃，连不爱甜食的自己也觉得细腻可口。特别是入冰箱后取出品味风味尤佳。喜欢那一丝丝的凉意一丝丝的甜味，入口的感觉特别绵软，很适合夏季食用的。这次还是没有用黄油，因为等融化嫌麻烦，继续用了橄榄油。不同的是这次用了水浴法烘焙的。我用的模具是八寸的活底蛋糕模具，成品有一点收腰，但口味还挺成功的。只是早上拍照心急得很，因为LG上班比较早。难得他如此喜欢吃了最大的两块。'
),
(   null,
    'p14.jpg',
    'p14-l.jpg',
    '【黑巧克力蛋糕】',
    12,
    '鸡蛋、豆角酱肉馅、西红柿鸡蛋馅、猪生抽、生抽、海鲜酱油、糖、盐',
    '酸奶蛋糕，这是第二次做。自前一次做了带去单位分享后，吃到的同事都说好吃，连不爱甜食的自己也觉得细腻可口。特别是入冰箱后取出品味风味尤佳。喜欢那一丝丝的凉意一丝丝的甜味，入口的感觉特别绵软，很适合夏季食用的。这次还是没有用黄油，因为等融化嫌麻烦，继续用了橄榄油。不同的是这次用了水浴法烘焙的。我用的模具是八寸的活底蛋糕模具，成品有一点收腰，但口味还挺成功的。只是早上拍照心急得很，因为LG上班比较早。难得他如此喜欢吃了最大的两块。'
),
(   null,
    'p0281.jpg',
    'p0281-l.jpg',
    '【酸甜开胃虾】',
    36,
    '明虾、番茄酱、白糖、白醋、葱、姜、淀粉',
    '话说有两个地方是我挪不动脚的，一个是图书馆，另外一个便是菜市场！ 每周有七天，留给自己的时间却很少。既要带儿子去上早教课，又要陪女儿上兴趣班，还要留一个半天带孩子们泡图书馆！ 有时真的觉得妈妈是这个世界上最伟大的职业，累，并快乐着！ 这个时节正是各类果蔬大量上市的时候，拖着买菜专用的小拉车，徜徉在人声鼎沸的菜市场，从海鲜区、肉类区再慢慢逛到我最喜爱的果蔬区，感受季节的变换带给人们餐桌上的喜悦………… '
),
(   null,
    'p2679.jpg',
    'p2679-l.jpg',
    '【桂香紫薯山药卷】',
    16.5,
    '切片吐司、紫薯、铁棍山药、糖桂花、炼乳',
    '今天用紫薯，山药和吐司来做一款漂亮又健康的点心，做为早餐或者夜宵都是很好的选择哦！ 做法其实很简单，只要将各种食材层叠卷起来就行。提前煮好山药和紫薯，那么只要几分钟就能完成。 但就是这么一点小小的改变，就能立刻让原本平淡无奇的吐司变身抢手货哟~ 生活总是这样，时不时的有一些小惊喜，才会更加精彩不是嘛~'
),
(   null,
    'p8489.jpg',
    'p8489-l.jpg',
    '【小米椒爆炒小公鸡】',
    32,
    '三黄鸡、杭椒、干红椒、新鲜小米椒、麻椒、八角、香叶、葱、姜、生抽',
    '算起来有一个星期没有更新了，忙着赶紧完成手头的工作，和孩子一起开启度假模式。我总是毫不避讳地称自己为吃货，对于我来说，度假中缺少美食是万万不可的。想要找一个风景与美食兼顾的度假地点可不太容易，工作之余忙着查路线，查攻略，总算是定好了目的地。其实我这个嗜辣族最想去的还是成都重庆一带，考虑到季节的原因，还是留到冬天再前往吧。今天上一道火辣辣的小米椒爆炒小公鸡，虽在家中，也是十足的过了把食辣的瘾，不擅吃辣的伙伴们做这道菜的时候可要记得减少辣椒的用量哦。'
),
(   null,
    'p7818.jpg',
    'p7818-l.jpg',
    '【口袋饼】',
    6.5,
    '面粉、黄瓜、香肠、热水、土豆、盐、醋、生抽、油。',
    '热水和面！面团擀成薄薄的面片之后切成长条，之后中间抹油！折叠之后用手把两边按扁，使其黏到一起！如图！然后用刀背划出花边！平底锅抹油小火煎制口袋饼，两边烙上金黄色即可！土豆切丝！黄瓜和香肠切条状！炒土豆丝，放入盐，醋和生抽炒均匀就可以了，然后放入烙好的口袋饼里，放入黄瓜和香肠即可！'
),
(   null,
    'p9138.jpg',
    'p9138-l.jpg',
    '【橄榄油版酸奶蛋糕】',
    32,
    '鸡蛋、玉米淀粉、绵白糖、白醋、低筋粉、橄榄油、酸奶。',
    '酸奶蛋糕，这是第二次做。自前一次做了带去单位分享后，吃到的同事都说好吃，连不爱甜食的自己也觉得细腻可口。特别是入冰箱后取出品味风味尤佳。喜欢那一丝丝的凉意一丝丝的甜味，入口的感觉特别绵软，很适合夏季食用的。这次还是没有用黄油，因为等融化嫌麻烦，继续用了橄榄油。不同的是这次用了水浴法烘焙的。我用的模具是八寸的活底蛋糕模具，成品有一点收腰，但口味还挺成功的。只是早上拍照心急得很，因为LG上班比较早。难得他如此喜欢吃了最大的两块。'
),
(   null,
    'p4788.jpg',
    'p4788-l.jpg',
    '【番茄肉酱意大利面】',
    25,
    '意大利面、番茄、洋葱、蒜泥、肉糜、黑胡椒粉、番茄酱、盐',
    '听说，台风天，电影和意大利面更配喔汤锅倒水烧开，放一勺盐一勺橄榄油，加入意面，煮13分钟。（意面种类不同，煮的时间也不一样，5-15分钟不等）。煮好的面控水，拌入一勺橄榄油，以防面粘连。平底锅倒油预热，蒜泥炒香，下肉糜翻炒至变色，倒入洋葱丁、番茄丁，翻炒一分钟，放番茄酱、盐、黑胡椒，继续翻炒。肉酱里加热水大火烧开，倒入意面转中火，待意面吸饱汤汁后，关火盛盘。'
),
(   null,
    'p7933.jpg',
    'p7933-l.jpg',
    '【放心油条】',
    1.5,
    '面粉、安琪油条膨松剂、温水、植物油。',
    '自己炸的油条不含明矾，也不用担心地沟油，吃的比较放心。准备中筋粉，油条膨松剂和植物油。面粉和膨松剂混合均匀，加入50-60度温水搅拌。揉成光滑的面团，盖上保鲜膜醒30分钟左右。将醒发好的面团切成长形小剂子，两个叠在一起用筷子按压一下。用手捏住两头抻拉一下，放入7成热（约180-200度）的油锅中炸至金黄即可。'
),
(   null,
    'p6611.jpg',
    'p6611-l.jpg',
    '【蒸饺】',
    12,
    '鸡蛋、豆角酱肉馅、西红柿鸡蛋馅、猪生抽、生抽、海鲜酱油、糖、盐',
    '昨天突然好想吃蒸饺，但是貌似没听过北京哪家蒸饺好吃，于是决定自己做啦，重要的事最近爱上做饭，能与大家分享美食乐趣也让我又燃起了烹饪的热情。想必最好吃的东西还是自己家的家常便饭！面粉300克，开水100ml左右（这个量可以在和面的时候自己调节下，蒸饺一定是烫面的）鸡蛋一个，我是用面包机和的面团，准备其他馅时一直在醒面（半小时内）。豆角酱肉馅：做法见我的豆角酱肉卤菜谱'
);
##SELECT * FROM kf_dish;
/*用户表*/
CREATE TABLE kf_users(
    userid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    uname VARCHAR(20),                     /*用户名*/
    pwd VARCHAR(20),                       /*密码*/
    phone VARCHAR(20)                      /*电话*/
);
INSERT INTO kf_users VALUES
(NULL,'mary','11111','13111112345'),
(NULL,'jerry','22222','13819196547'),
(NULL,'john','33333','13819196547');
/*订单表*/
CREATE TABLE kf_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,     /*订单ID*/
    userid INT,                             /*用户*/
    phone VARCHAR(16),                      /*联系电话*/
    user_name VARCHAR(16),                  /*收货方用户名*/
    order_time LONG,                        /*下单时间*/
    addr VARCHAR(256),                      /*订单地址*/
    totalprice FLOAT(6,2)                   /*订单总价*/
);
INSERT INTO kf_order VALUES
(NULL,1,'13501234567','大旭',1445154859209,'大钟寺中鼎B座',20.5),
(NULL,1,'13501257543','琳妹妹',1445154997543,'大钟寺中鼎B座',12.5),
(NULL,2,'13207654321','东东',1445254997612,'大钟寺中鼎B座',55),
(NULL,2,'13899999999','文兄',1445354959209,'大钟寺中鼎B座',35),
(NULL,3,'13683675299','梅姐',1445355889209,'大钟寺中鼎B座',45);
/**购物车表**/
CREATE TABLE kf_cart(
    ctid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    userid INT,                          /*用户编号：假定有用户id为 1 和 3 的两个用户有数据*/
    did INT,                             /*产品编号*/
    dishCount INT                      /*数量*/
);
INSERT INTO kf_cart VALUES (1,1,1,1),
(2,1,2,4),
(3,1,5,2),
(4,3,2,10),
(5,3,6,1);
##SELECT * FROM kf_order;
/**订单详情表**/
CREATE TABLE kf_orderdetails(
    oid INT ,                            /*订单编号*/
    did INT,                             /*产品id*/
    dishCount INT,                     /*购买数量*/
    price FLOAT(8,2)                     /*产品单价：需要记载，因为产品价格可能波动*/
);
INSERT INTO kf_orderdetails VALUES (1,1,2,5),
(1,2,1,10.5),
(2,3,1,12.5),
(3,1,3,5),
(3,2,4,10),
(4,4,7,5),
(5,5,5,4),
(5,6,2,12.5);
